fixtures/configuration/src/Documents/Ф_ТестированиеМонитораИзменений/Ф_ТестированиеМонитораИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ф_ТестированиеМонитораИзменений</name>
  <tabularSections>
    <name>Объекты</name>
    <attributes>
      <name>ИзменяемыйОбъект</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fixtures/configuration/src/InformationRegisters/Ф_КомментарииПоОбъекту/Ф_КомментарииПоОбъекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ф_КомментарииПоОбъекту</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fixtures/configuration/src/Documents/Ф_ТестированиеМонитораИзменений/ObjectModule.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2026
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДобавитьКомментарийПроведения();
	
	НаборКомментариев = РегистрыСведений.Ф_КомментарииПоОбъекту.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаОбъекта Из Объекты Цикл
		
		ЗаписьКомментария = НаборКомментариев.Добавить();
		ЗаписьКомментария.Объект = СтрокаОбъекта.ИзменяемыйОбъект;
		ЗаписьКомментария.Комментарий = СтрШаблон("Изменение '%1': '%2' -> '%3'", СтрокаОбъекта.ИмяРеквизита, Объект[СтрокаОбъекта.ИмяРеквизита], СтрокаОбъекта.НовоеЗначение);
		ЗаписьКомментария.Период = Дата;
		
		Объект = СтрокаОбъекта.ИзменяемыйОбъект.ПолучитьОбъект();
		Объект[СтрокаОбъекта.ИмяРеквизита] = СтрокаОбъекта.НовоеЗначение;
		Объект.Записать();
		
	КонецЦикла;
	
	НаборКомментариев.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКомментарийПроведения()
	
	ЗаписьКомментария = РегистрыСведений.Ф_КомментарииПоОбъекту.СоздатьМенеджерЗаписи();
	ЗаписьКомментария.Объект = Ссылка;
	ЗаписьКомментария.Комментарий = "Проведение объекта";
	ЗаписьКомментария.Период = Дата;
	ЗаписьКомментария.Записать();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
